In [14]:
import  pandas as pd
import numpy as np

## Load DataFrame

In [15]:
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Find all columns with NaN vlaues

In [90]:
df.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

### Shohw rows for which Fare values is NaN

In [91]:
# TODO: why mask1 ne mask2 ?
mask1 = df.Fare == np.nan
print(mask1.sum())

mask2 = df['Fare'].isna()
print(mask2.sum())

0
1

In [89]:
df[ mask2 ]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
152,1044,3,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,NaN,S

### Find all women

In [100]:
# not correct
# (df.Sex == 'female').count()

In [101]:
tmp = df.Sex.value_counts()
print(tmp.female)

152

In [99]:
count = df[df.Sex == 'female'].shape[0]
count

152

### Find all women travaling in 1st class:

In [102]:
tmp = df[(df.Sex == 'female') & (df.Pclass==1)]
tmp.shape[0]

50